In [1]:
import numpy as np
import pandas as pd

In [2]:
# Series can be created from list, dictionary, numpy
num_list = [1,2,3,4,5]
pd.Series(num_list)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
week_days = ['Mon','Tues','Wed','Thur','Fri']

pd.Series(week_days, index=["a", "b", "c", "d", "e"])

a     Mon
b    Tues
c     Wed
d    Thur
e     Fri
dtype: object

In [4]:
# creating series from numpy array
arr = np.array([1,2,3,4,5])
pd.Series(arr)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
# Creating Dataframes, this can be done using dictionary, 2D aray and Series
countries = {'Name': ['USA', 'India', 'German', 'Rwanda'], 
             
             'Codes':[1, 91, 49, 250] }

pd.DataFrame(countries)

     Name  Codes
0     USA      1
1   India     91
2  German     49
3  Rwanda    250

In [6]:
# Creating a dataframe from a 2D array

array_2d = np.array ([[1,2,3], [4,5,6], [7,8,9]])

pd.DataFrame(array_2d, columns = ['column 1', 'column 2', 'column 3' ])

   column 1  column 2  column 3
0         1         2         3
1         4         5         6
2         7         8         9

In [8]:
# Creating dataframe from pandas series
countries_code = { "United States": 1,
                 "India": 91,
                 "Germany": 49,
                 "China": 86,
                 "Rwanda":250}

pd_series = pd.Series (countries_code)

# pd.Series(countries_code)

df = pd.DataFrame(pd_series, columns = ['Codes'])
df

               Codes
United States      1
India             91
Germany           49
China             86
Rwanda           250

In [9]:
# adding a column to the above dataframe
df ['Population'] = [100, 450, 575, 5885, 533]

df

               Codes  Population
United States      1         100
India             91         450
Germany           49         575
China             86        5885
Rwanda           250         533

In [10]:
# renoving a column
df.drop('Population', axis =1)

               Codes
United States      1
India             91
Germany           49
China             86
Rwanda           250

In [11]:
df.columns

Index(['Codes', 'Population'], dtype='object')

In [12]:
# Creating DataFrame from a dictionary

countries = {'Name': ['USA', 'India', 'German', 'Rwanda'], 
             
             'Codes':[1, 91, 49, 250] }

df = pd.DataFrame(countries, index=['a', 'b', 'c', 'd'])
df

     Name  Codes
a     USA      1
b   India     91
c  German     49
d  Rwanda    250

In [13]:
print(df.Name)
print(df.Codes)

a       USA
b     India
c    German
d    Rwanda
Name: Name, dtype: object
a      1
b     91
c     49
d    250
Name: Codes, dtype: int64

In [14]:
# This will return the first two rows
df [0:2]

    Name  Codes
a    USA      1
b  India     91

In [15]:
# Using loc to selcd data by the label indexes
print(df.loc['a'])
print(df.loc['b':'d'])

Name     USA
Codes      1
Name: a, dtype: object
     Name  Codes
b   India     91
c  German     49
d  Rwanda    250

In [16]:
# using iloc to select by default interger index
df.iloc[2]

Name     German
Codes        49
Name: c, dtype: object

## Conditional Statement

In [17]:
df [df['Codes'] ==49]

     Name  Codes
c  German     49

In [19]:
# isin() return false or true when provided value is included in dataframe
df2 = pd.DataFrame(np.array ([[1,2,3], [4,5,6], [7,8,9]]), 
                   columns = ['column 1', 'column 2', 'column 3'])
print(df2)
df2.isin([0,3,4,5,7])

   column 1  column 2  column 3
0         1         2         3
1         4         5         6
2         7         8         9

   column 1  column 2  column 3
0     False     False      True
1      True      True     False
2      True     False     False

In [20]:
df2.where(df2 > 4)

   column 1  column 2  column 3
0       NaN       NaN       NaN
1       NaN       5.0       6.0
2       7.0       8.0       9.0

In [21]:
# you can use where to find and replace
df2.where(df2 > 4, 0)

   column 1  column 2  column 3
0         0         0         0
1         0         5         6
2         7         8         9

## Iterating

In [22]:
for col_name, content in df2.items():
    print(col_name)
    print(content)

column 1
0    1
1    4
2    7
Name: column 1, dtype: int64
column 2
0    2
1    5
2    8
Name: column 2, dtype: int64
column 3
0    3
1    6
2    9
Name: column 3, dtype: int64

In [ ]:
# Iterate over DataFrame rows as (index, Series) pairs
for row in df2.iterrows():
    print(row)

## Dealing with missing data

In [23]:
# Creating a dataframe

df3 = pd.DataFrame(np.array ([[1,2,3], [4,np.nan,6], [7,np.nan,np.nan]]), 
                   columns = ['column 1', 'column 2', 'column 3'])

In [24]:
# recognizing the missing values
df3.isnull()

   column 1  column 2  column 3
0     False     False     False
1     False      True     False
2     False      True      True

In [25]:
# Calculating number of the missing values in each feature

df3.isnull().sum()

column 1    0
column 2    2
column 3    1
dtype: int64

In [26]:
#  Recognizng non missig values

df3.notna()

   column 1  column 2  column 3
0      True      True      True
1      True     False      True
2      True     False     False

In [27]:
# droppin gmissing values
df3.dropna() # drops each row with a missing value

   column 1  column 2  column 3
0       1.0       2.0       3.0

In [28]:
# dropping specifc column(s)
df3['column 3'].dropna()

0    3.0
1    6.0
Name: column 3, dtype: float64

In [29]:
# filling missing value
df3.fillna('fillme')

   column 1 column 2 column 3
0       1.0      2.0      3.0
1       4.0   fillme      6.0
2       7.0   fillme   fillme

## More operations and functions

In [30]:
df4 = pd.DataFrame({'Product Name':['Shirt','Boot','Bag'], 
              'Order Number':[45,56,64], 
              'Total Quantity':[10,5,9]}, 
              columns = ['Product Name', 'Order Number', 'Total Quantity'])

In [31]:
# Return a summary about the dataframe

df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product Name    3 non-null      object
 1   Order Number    3 non-null      int64
 2   Total Quantity  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

In [33]:
print(df4.head(1)) # returns head
df4.tail(1) # returns tail

  Product Name  Order Number  Total Quantity
0        Shirt            45              10

  Product Name  Order Number  Total Quantity
2          Bag            64               9

In [34]:
print(df4.shape) # gives shape
print(df4.size) # gives size

(3, 3)
9

In [35]:
print(df4['Product Name'].unique()) # returns unique value
df4['Product Name'].nunique() # number of uniques values in a col

['Shirt' 'Boot' 'Bag']

3

In [36]:
# Counting the occurence of each value in a column 

df4['Product Name'].value_counts()

Shirt    1
Boot     1
Bag      1
Name: Product Name, dtype: int64

In [37]:
# Double the quantity product

def double_quantity(x):
  return x * x

In [38]:
df4['Total Quantity'].apply(double_quantity)

0    100
1     25
2     81
Name: Total Quantity, dtype: int64

In [39]:
df4.sort_values(['Order Number']) # sorting

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9

## Aggregation Methods

In [40]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9

In [41]:
df4.describe()

       Order Number  Total Quantity
count      3.000000        3.000000
mean      55.000000        8.000000
std        9.539392        2.645751
min       45.000000        5.000000
25%       50.500000        7.000000
50%       56.000000        9.000000
75%       60.000000        9.500000
max       64.000000       10.000000

In [42]:
df4.describe().transpose()

                count  mean       std   min   25%   50%   75%   max
Order Number      3.0  55.0  9.539392  45.0  50.5  56.0  60.0  64.0
Total Quantity    3.0   8.0  2.645751   5.0   7.0   9.0   9.5  10.0

In [43]:
df4['Total Quantity'].mode()
# same for max(), min(), mean(), median(), (std), prod(), sum(), var()

0     5
1     9
2    10
Name: Total Quantity, dtype: int64

## Groupby

In [44]:
df4 = pd.DataFrame({'Product Name':['Shirt','Boot','Bag', 'Ankle', 'Pullover', 'Boot', 'Ankle', 'Tshirt', 'Shirt'], 
              'Order Number':[45,56,64, 34, 67, 56, 34, 89, 45], 
              'Total Quantity':[10,5,9, 11, 11, 8, 14, 23, 10]}, 
              columns = ['Product Name', 'Order Number', 'Total Quantity'])

In [45]:
df4

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3        Ankle            34              11
4     Pullover            67              11
5         Boot            56               8
6        Ankle            34              14
7       Tshirt            89              23
8        Shirt            45              10

In [46]:
df4.groupby('Product Name').mean()

              Order Number  Total Quantity
Product Name
Ankle                 34.0            12.5
Bag                   64.0             9.0
Boot                  56.0             6.5
Pullover              67.0            11.0
Shirt                 45.0            10.0
Tshirt                89.0            23.0

In [47]:
df4.groupby(['Product Name', 'Order Number']).max()

                           Total Quantity
Product Name Order Number
Ankle        34                        14
Bag          64                         9
Boot         56                         8
Pullover     67                        11
Shirt        45                        10
Tshirt       89                        23

In [48]:
df4.groupby('Product Name').aggregate(['min', 'max', 'sum'])

             Order Number          Total Quantity
                      min max  sum            min max sum
Product Name
Ankle                  34  34   68             11  14  25
Bag                    64  64   64              9   9   9
Boot                   56  56  112              5   8  13
Pullover               67  67   67             11  11  11
Shirt                  45  45   90             10  10  20
Tshirt                 89  89   89             23  23  23

## Combining Datasets

In [49]:
# Creating dataframes

df1 = pd.DataFrame({'Col1':['A','B','C'],
                   'Col2':[1,2,3]}, 
                   index=['a','b','c'])

df2 = pd.DataFrame({'Col1':['D','E','F'],
                   'Col2':[4,5,6]}, 
                   index=['d','e','f'])


df3 = pd.DataFrame({'Col1':['G','I','J'],
                   'Col2':[7,8,9]}, 
                   index=['g', 'i','j'])

In [50]:
# Concatenating: Adding one dataset to another

pd.concat([df1, df2, df3])

  Col1  Col2
a    A     1
b    B     2
c    C     3
d    D     4
e    E     5
f    F     6
g    G     7
i    I     8
j    J     9

In [51]:
# default axis is zero when changed to 1 this happens
pd.concat([df1, df2, df3], axis=1)

  Col1  Col2 Col1  Col2 Col1  Col2
a    A   1.0  NaN   NaN  NaN   NaN
b    B   2.0  NaN   NaN  NaN   NaN
c    C   3.0  NaN   NaN  NaN   NaN
d  NaN   NaN    D   4.0  NaN   NaN
e  NaN   NaN    E   5.0  NaN   NaN
f  NaN   NaN    F   6.0  NaN   NaN
g  NaN   NaN  NaN   NaN    G   7.0
i  NaN   NaN  NaN   NaN    I   8.0
j  NaN   NaN  NaN   NaN    J   9.0

In [53]:
df1 = pd.DataFrame({'Name': ['Joe', 'Joshua', 'Jeanne', 'David'],
                        'Role': ['Manager', 'Developer', 'Engineer', 'Scientist']})

df2 = pd.DataFrame({'Name': ['David', 'Joshua', 'Joe', 'Jeanne'],
'Year Hired': [2018, 2017, 2020, 2018]})

df3 = pd.DataFrame({'Name': ['David', 'Joshua', 'Joe', 'Jeanne'],
'No of Leaves': [15, 3, 10, 12]})

In [54]:
df1

     Name       Role
0     Joe    Manager
1  Joshua  Developer
2  Jeanne   Engineer
3   David  Scientist

In [55]:
df2

     Name  Year Hired
0   David        2018
1  Joshua        2017
2     Joe        2020
3  Jeanne        2018

In [60]:
pd.merge(df1, df2, how='inner', on="Name")

     Name       Role  Year Hired
0     Joe    Manager        2020
1  Joshua  Developer        2017
2  Jeanne   Engineer        2018
3   David  Scientist        2018

In [52]:
df1 = pd.DataFrame({'col1': ['K0', 'K0', 'K1', 'K2'],
                     'col2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
df2 = pd.DataFrame({'col1': ['K0', 'K1', 'K1', 'K2'],
                               'col2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [63]:
df1 = pd.DataFrame({'Col1': ['A', 'B', 'C'],
                     'Col2': [11, 12, 13]},
                      index=['a', 'b', 'c']) 

df2 = pd.DataFrame({'Col3': ['D', 'E', 'F'],
                    'Col4': [14, 14, 16]},
                      index=['a', 'c', 'd'])

In [64]:
df1.join(df2, how='inner')

  Col1  Col2 Col3  Col4
a    A    11    D    14
c    C    13    E    14

In [65]:
## Beyond Dataframes
# Let's download the data 

!curl -O https://raw.githubusercontent.com/nyandwi/public_datasets/master/housing.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100 1390k  100 1390k    0     0   308k      0  0:00:04  0:00:04 --:--:--  324k

In [66]:
data = pd.read_csv('housing.csv')

In [67]:
data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [68]:
data.to_csv('housing_dataset', index=False)

In [69]:
data.to_excel('housing_excel.xlsx', index=False)

## Exploratory Data Analysis